{
    "months": [
        {
            "month" : 1,
            "days": [
                {
                    "day": 8,
                    "events": [
                        "The Fellowship of the Ring reach Hollin and they spot the Crebain."
                    ]
                },

                {
                    "day": 11,
                    "events": [
                        "The Fellowship of the Ring camps at the foot of the Redhorn Pass. They try to cross the pass at night but are unsuccessful."
                    ]
                },

                {
                    "day": 12,
                    "events": [
                        "Unable to cross the pass of Caradhras, the Fellowship of the Ring return to Hollin. In the night they are attacked by a pack of Wargs."
                    ]
                },

                {
                    "day": 13,
                    "events": [
                        "The Fellowship is attacked by Wolves in the early hours of the day.",
                        "The Fellowship reach the West-gate of Moria at nightfall where they are attacked by the Watcher.",
                        "Gollum begins to trail the Ring-bearer."
                    ]
                },
                
                {
                    "day": 15,
                    "events": [
                        "Gandalf falls from the Bridge of Khazad-Dûm with the balrog \"Durin's Bane\".",
                        "The Fellowship leave Moria and enter Dimrill Dale. Gimli, Frodo and Sam gaze in Mirrormere.",
                        "The Fellowship of the Ring find the Chamber of Mazarbul and Balin's Tomb. Gimli takes the Book of Mazarbul."
                    ]
                },
                
                {
                    "day": 17,
                    "events": [
                        "The Fellowship of the Ring pass the Silverlode and reach the Naith and Cerin Amroth. They come to Caras Galadhon in the evening."
                    ]
                },
                
                {
                    "day": 18,
                    "events": [
                        "Saruman hears of the Fellowship of the Ring and sends a company led by Uglúk to intercept them."
                    ]
                },
                
                {
                    "day": 23,
                    "events": [
                        "Gandalf pursues the Balrog to the peak of Celebdil."
                    ]
                },
                
                {
                    "day": 25,
                    "events": [
                        "Gandalf casts down the Balrog from the peak of Celebdil, and passes away afterwards."
                    ]
                }
            ]
        },

        {
            "month" : 2,
            "days": [
                {
                    "day": 1,
                    "events": [
                        "Aragorn captures Gollum in the Dead Marshes."
                    ]
                },

                {
                    "day": 15,
                    "events": [
                        "The Fellowship of the Ring rests in Lórien. Frodo is shown The Mirror of Galadriel.", 
                        "Gandalf returns to life."
                    ]
                },
                
                {
                    "day": 16,
                    "events": [
                        "The Fellowship leave Lothlórien. Gollum observes their departure and follows them as they travel south over the Anduin by boat."
                    ]
                },
                
                {
                    "day": 17,
                    "events": [
                        "Gwaihir bears Gandalf to Lothlórien."
                    ]
                },
                
                {
                    "day": 23,
                    "events": [
                        "The Fellowship are ambushed near Sarn Gebir at night. A frightened Gollum flees to the eastern bank and hides in the Emyn Muil. A flying shadow approaches but Legolas shoots it with the bow of Galadriel."
                    ]
                },
                
                {
                    "day": 25,
                    "events": [
                        "First Battle of the Fords of Isen during which Théodred son of Théoden is slain.", 
                        "The Fellowship passes the Argonath and reaches Nen Hithoel; they camp at Parth Galen."
                    ]
                },
                
                {
                    "day": 26,
                    "events": [
                        "The breaking of the Fellowship of the Ring. Merry and Pippin are captured by Orcs from the North, Mordor and Isengard. Boromir is slain trying to protect them and his horn is heard in Minas Tirith. Frodo and Samwise enter the eastern Emyn Muil."
                    ]
                },
                
                {
                    "day": 27,
                    "events": [
                        "Orc skirmish, Grishnákh leaves. Pippin cuts his rope and drops his brooch."
                    ]
                },
                
                {
                    "day": 29,
                    "events": [
                        "Merry and Pippin escape the Orcs and Uruk-hai and meet Treebeard."
                    ]
                }
            ]
        },

        {
            "month": 3,
            "days": [
                {
                    "day": 1,
                    "events": [
                        "Aragorn, son of Arathorn, Heir of Isildur, is born.",
                        "The Hunters enter Fangorn and meets Gandalf the White. They set out for Edoras.",
                        "Aragorn, son of Arathorn, Heir of Isildur, is born."
                    ]
                },

                {
                    "day": 2,
                    "events": [
                        "Frodo, Sam and Gollum finally reach the end of the Dead Marshes.",
                        "Gandalf comes to Edoras and heals Théoden. Éomer is released and Théoden holds his sword again.",
                        "Second Battle of the Fords of Isen, Erkenbrand is defeated.",
                        "Entmoot ends in afternoon. The Ents march on Isengard and reach it at night."
                    ]
                },

                {
                    "day": 3,
                    "events": [
                        "Théoden retreats to Helm's Deep, where the Battle of the Hornburg ensues.",
                        "The Ents, led by Treebeard, change the course of Isen and complete the destruction of Isengard."
                    ]
                },
                
                {
                    "day": 4,
                    "events": [
                        "Gandalf and Erkenbrand show up and finish the Battle of the Hornburg.",
                        "The River Isen is restored to its original course."
                    ]
                },
                
                {
                    "day": 5,
                    "events": [
                        "Théoden, Gandalf and company reach Isengard and parley with Saruman. Saruman's staff is broken.",
                        "Pippin looks into the Orthanc-stone and a short time later a winged Nazgûl passes over the camp. In response, Gandalf sets out with the Hobbit for Minas Tirith.",
                        "Frodo hides in sight of the Morannon, and leaves at dusk.",
                        "Thorin Oakenshield meets with Gandalf at the Prancing Pony in Bree. They agree on setting out on the Quest of Erebor."
                    ]
                },
                
                {
                    "day": 6,
                    "events": [
                        "Aragorn is overtaken by the Grey Company in the early hours of the day.",
                        "Aragorn uses the Orthanc-stone and reveals himself to the enemy."
                    ]
                },
                
                {
                    "day": 7,
                    "events": [
                        "Faramir takes Frodo and Sam to Henneth Annûn. He learns about Frodo carrying the One Ring but does not try to take it."
                    ]
                },
                
                {
                    "day": 8,
                    "events": [
                        "Frodo and Sam leave Faramir at Henneth Annûn with Gollum as their guide.",
                        "Aragorn takes the Paths of the Dead at daybreak reaching the Stone of Erech at midnight."
                    ]
                },
                
                {
                    "day": 9,
                    "events": [
                        "Gandalf and Pippin reach Minas Tirith.",
                        "Faramir leaves Henneth Annûn for Cair Andros.",
                        "Frodo, Sam and Gollum reach the Morgul Road at dusk.",
                        "Darkness begins to flow out of Mordor.",
                        "Aragorn sets out from Erech and comes to Calembel."
                    ]
                },
                
                {
                    "day": 10,
                    "events": [
                        "The Dawnless Day.",
                        "Frodo, Sam and Gollum pass the Cross-roads, and see the Morgul-host set forth, towards Minas Tirith.",
                        "The Muster of Rohan takes place. The Rohirrim ride from Harrowdale.",
                        "Faramir is rescued by Gandalf and Imrahil outside the gates of the City. He meets Pippin and reports to Denethor.",
                        "An army of Orcs from the Morannon takes Cair Andros and passes into Anórien.",
                        "Cirion sends Borondir and his companion in search of the Éothéod.",
                        "Sauron returns to Dol Guldur, The Watchful Peace ends.",
                        "Erebor founded and the Arkenstone is discovered.",
                        "The Balrog Durin's Bane is awakened by the Dwarves of Moria killing Durin VI. The Nazgûl return to Mordor.",
                        "Kingdom of Angmar is destroyed in the Battle of Fornost."
                    ]
                },
                
                {
                    "day": 11,
                    "events": [
                        "Denethor sends Faramir to Osgiliath.",
                        "Eastern Rohan is invaded from the north.",
                        "Orcs of Dol Guldur assail Lothlórien, but they are beaten back."
                    ]
                },

                {
                    "day": 12,
                    "events": [
                        "Gollum leads Frodo and Sam into Shelob's Lair."
                    ]
                },

                {
                    "day": 13,
                    "events": [
                        "Frodo is stabbed by Shelob and subsequently captured by the Orcs of Cirith Ungol.",
                        "Aragorn arrives at Pelargir and captures the fleet.",
                        "Beregond sees a strange light in the tower of Minas Tirith, being Denethor confronting Sauron.",
                        "Frodo gets ill, on the anniversary of his poisoning by Shelob."
                    ]
                },
                
                {
                    "day": 14,
                    "events": [
                        "Minas Tirith is besieged."
                    ]
                },
                
                {
                    "day": 15,
                    "events": [
                        "The Witch King breaks the gates of Minas Tirith.",
                        "Denethor tries to burn himself and Faramir on a pyre. Faramir is rescued.",
                        "The horns of the Rohirrim echo in the sides of Mindolluin at cockcrow. King Théoden of Rohan dies on Pelennor Fields, mortally wounded by the Witch King.",
                        "The Battle Under Trees in Mirkwood. Thranduil can drive the enemy from Dol Guldur back.",
                        "Second assault on Lothlórien.",
                        "Thorin Oakenshield meets with Gandalf at the Prancing Pony in Bree. They agree on setting out on the Quest of Erebor."
                    ]
                },
                
                {
                    "day": 16,
                    "events": [
                        "The Last Debate is held outside Minas Tirith and it is decided that they shall muster an army and fight against Sauron."
                    ]
                },
                
                {
                    "day": 17,
                    "events": [
                        "Battle of Dale takes place where both King Brand and King Dain Ironfoot die.",
                        "Shagrat is slain after bringing Frodo's cloak, mithril shirt and sword to Barad-dûr."
                    ]
                },
                
                {
                    "day": 20,
                    "events": [
                        "Faramir and Éowyn meet in the Houses of Healing."
                    ]
                },
                
                {
                    "day": 21,
                    "events": [
                        "Aragorn delivers Gollum as a prisoner to Thranduil of Mirkwood."
                    ]
                },
                
                {
                    "day": 22,
                    "events": [
                        "Third attack on Lorien."
                    ]
                },
                
                {
                    "day": 23,
                    "events": [
                        "Aragorn dismisses the faint-hearted among the Host of the West and commands them to to liberate Cair Andros.",
                        "Gandalf arrives in Mirkwood and begins the questioning of Gollum."
                    ]
                },
                
                {
                    "day": 24,
                    "events": [
                        "The Host of the West set up a camp outside of the Morannon.",
                        "The last day of the Third Age, according to the reckoning of Gondor."
                    ]
                },
                
                {
                    "day": 25,
                    "events": [
                        "Frodo and Samwise reach the Sammath Naur, the ring is destroyed, and Sauron defeated.",
                        "Elanor the Fair, daughter of Samwise, is born."
                    ]
                },
                
                {
                    "day": 27,
                    "events": [
                        "Bard II and Thorin III Stonehelm drive the enemy from Dale."
                    ]
                },
                
                {
                    "day": 28,
                    "events": [
                        "Celeborn crosses the river Anduin and leads an attack on Dol Guldur. Galadriel throws down its walls."
                    ]
                },
                
                {
                    "day": 29,
                    "events": [
                        "Gandalf leaves Mirkwood for the Shire."
                    ]
                }
            ]
        },

        {
            "month": 4,
            "days": [
                {
                    "day": 6,
                    "events": [
                        "The meeting of Celeborn and Thranduil takes place in the midst of Mirkwood.",
                        "The mallorn tree planted by Samwise Gamgee in the Party Field begins to flower.",
                        "Samwise Gamgee is born.",
                        "Eorl the Young sets out with the Éothéod towards Calenardhon.",
                        "Gandalf visits Bag End but Bilbo Baggins is missing. He talks with Holman Greenhand and realises Bilbo is the right person for the Quest for Erebor."
                    ]
                },
                
                {
                    "day": 8,
                    "events": [
                        "The Ring-bearers Samwise and Frodo are honoured on the Field of Cormallen."
                    ]
                },
                
                {
                    "day": 12,
                    "events": [
                        "Gandalf reaches Hobbiton."
                    ]
                },
                
                {
                    "day": 13,
                    "events": [
                        "Gandalf examines Bilbo's Ring and determines from its inscription that it is the One Ring. He tells Frodo of the Ring's history and Frodo volunteers to leave the Shire in order to secure the Ring."
                    ]
                },
                
                {
                    "day": 20,
                    "events": [
                        "Nothing eventful happened."
                    ]
                },
                
                {
                    "day": 21,
                    "events": [
                        "Thráin sets out for the Lonely Mountain.",
                        "The Battle of Azanulbizar is fought and Azog is killed.",
                        "Destruction of Dale and Erebor by the dragon Smaug.",
                        "Tobold Hornblower plants Pipe-weed"
                    ]
                },

		{
		    "day": 23,
		    "events": [
			    "This is a test"
		    ]
	    	},

                {
                    "day": 25,
                    "events": [
                        "Gandalf visits Bag End looking for somebody to take part in an adventure but Bilbo rejects the offer."
                    ]
                },
                
                {
                    "day": 26,
                    "events": [
                        "Thirteen dwarves and Gandalf arrive at Bag End. Bilbo learns of the Lonely Mountain and Smaug and agrees to accompany the dwarves and Gandalf on their adventure."
                    ]
                },
                
                {
                    "day": 27,
                    "events": [
                        "Bilbo starts together with the dwarves and Gandalf his journey to the Lonely Mountain."
                    ]
                }
            ]
        },

        {
            "month": 5,
            "days": [
                {
                    "day": 1,
                    "events": [
                        "Coronation of King Aragorn Elessar. He bids Faramir to remain Steward of Gondor.",
                        "Elrond and Arwen set out from Rivendell.",
                        "Samwise Gamgee marries Rose Cotton.",
                        "Aragorn and Gandalf meet at Sarn Ford. Gandalf tells Aragorn of Frodo's plan to leave the Shire.",
                        "Bilbo and Gandalf reach Rivendell after their adventures at the Lonely Mountain.",
                        "Sauron returns to Mordor."
                    ]
                },
                
                {
                    "day": 20,
                    "events": [
                        "Arwen and Elrond come to Lothlórien where they will stay for one week before continuing their journey to Minas Tirith.."
                    ]
                },
                
                {
                    "day": 27,
                    "events": [
                        "The Escort of Arwen leaves Lothlórien."
                    ]
                }
            ]
        },
        
        {
            "month": 6,
            "days": [
                {
                    "day": 19,
                    "events": [
                        "Faramir dreams of Isildur's Bane for the first time."
                    ]
                },

                {
                    "day": 20,
                    "events": [
                        "Sauron launch an attack on Osgiliath.",
                        "Thranduil is attacked in Mirkwood and Gollum escapes."
                    ]
                },

                {
                    "day": 22,
                    "events": [
                        "Gandalf meets Radagast.",
                        "Bilbo Baggins returns to Bag End after the Quest of Erebor and learns he has been declared dead."
                    ]
                },

                {
                    "day": 25,
                    "events": [
                        "Aragorn II finds the sapling of the White Tree."
                    ]
                }
            ]
        },
        
        {
            "month": 7,
            "days": [
                {
                    "day": 4,
                    "events": [
                        "Boromir sets out from Minas Tirith."
                    ]
                },
                
                {
                    "day": 9,
                    "events": [
                        "News of the oncoming of the enemy from the south-east reaches Eärnil. He and his Southern Army are already in position, and plan to meet the Wainriders at the river Poros."
                    ]
                },

                {
                    "day": 10,
                    "events": [
                        "Gandalf imprisoned in Orthanc by Saruman."
                    ]
                },
                
                {
                    "day": 12,
                    "events": [
                        "The Disaster of the Morannon. Death of Ondoher, King of Gondor, and his sons Artamir and Faramir."
                    ]
                },

                {    
                    "day": 13,
                    "events": [
                        "In the last stages of the Disaster of the Morannon, Minohtar is slain by an arrow, and his forces are routed. Eärnil arrives at the battlefield, and is victorious in the Battle of the Camp."
                    ]
                },


                {
                    "day": 19,
                    "events": [
                        "Bilbo meets Gollum under the Misty Mountains and finds the One Ring."
                    ]
                }
            ]
        },
        
        {
            "month": 8,
            "days": [
                {
                    "day": 10,
                    "events": [
                        "Funeral of Théoden is held outside Edoras"
                    ]
                },

                {
                    "day": 15,
                    "events": [
                        "Treebeard releases Saruman from Orthanc."
                    ]
                },

                {
                    "day": 28,
                    "events": [
                        "Gandalf and the four Hobbits overtake Saruman. While Frodo and his friends go to Rivendell, Saruman heads straight for the Shire."
                    ]
                }
            ]
        },

        {
            "month": 9,
            "days": [
                {
                    "day": 13,
                    "events": [
                        "Celeborn and Galadriel depart, the rest of the escort set out for Rivendell."
                    ]
                },
                
                {
                    "day": 18,
                    "events": [
                        "The Black Riders cross the Fords of Isen.",
                        "Gandalf is rescued by Gwaihir from the top of Orthanc in the early hours.",
                        "The Black Riders visit Saruman who lies that Gandalf has \"confessed\", and gives them directions to the Shire."
                    ]
                },
                
                {
                    "day": 19,
                    "events": [
                        "Gandalf arrives at Edoras but is denied entrance."
                    ]
                },
                
                {
                    "day": 20,
                    "events": [
                        "Gandalf gains entrance to Edoras and warns Theoden of Saruman. Theoden refuses to listen and sends Gandalf away.",
                        "Two covered carts leave Bag End for Frodo's new house in Crickhollow. They convey the furniture and goods that Frodo has not sold by way of the Brandywine Bridge."
                    ]
                },
                
                {
                    "day": 21,
                    "events": [
                        "Gandalf and the Hobbits arrive at Rivendell."
                    ]
                },
                
                {
                    "day": 22,
                    "events": [
                        "Saruman comes to the Shire.",
                        "Frodo and Sam meet the Last Riding of the Keepers of the Rings in Woody End.",
                        "Bilbo Baggins becomes 131 years old, the longeviest Hobbit in history.",
                        "Samwise Gamgee leaves Middle-earth, last of the Ring-bearers.",
                        "Dwalin dies at the age of 340 years.",
                        "The Black Riders reach Sarn Ford and drive off the Rangers guarding it.",
                        "Birthday of Frodo Baggins. Merry and Fredegar leave for Crickhollow with a cart of Frodo's belongings.",
                        "Bilbo turns 111 and throws the Farewell Party at which he announces his intention to leave the Shire. He leaves behind the One Ring and sets off. Frodo turns 33 and comes of age. He inherits Bag End and all the things Bilbo leaves behind.",
                        "Frodo Baggins is born.",
                        "Orodruin re-awakens.",
                        "Last meeting of the White Council.",
                        "Sauron reveals himself in Mordor and starts to rebuild Barad-dûr.",
                        "Thorin and the company arrive in Lake-town.",
                        "Bilbo Baggins is born."
                    ]
                },
                
                {
                    "day": 23,
                    "events": [
                        "One of the Black Riders comes to Hobbiton at nightfall.",
                        "Gandalf leaves Rohan after taming Shadowfax.",
                        "The day after the Birthday Party, Frodo manages the inheritance of Bilbo's belongings, and keeps keen treasure-seekers out of Bag End."
                    ]
                },
                
                {
                    "day": 24,
                    "events": [
                        "Gandalf crosses the River Isen.",
                        "The Hobbits encounter the Nazgûl near Woody End but the chanting of approaching elves scare them away. The Hobbits meet Gildor and the High Elves and camp with them during the night."
                    ]
                },
                
                {
                    "day": 25,
                    "events": [
                        "The Hobbits reach Farmer Maggot's estates in the afternoon; they meet Merry near the Ferry and Crickhollow in the night."
                    ]
                },
                
                {
                    "day": 26,
                    "events": [
                        "The four Hobbits encounter the evil tree Old Man Willow and are rescued by Tom Bombadil. They spend the night at Tom's house.",
                        "Frodo, Sam, Merry and Pippin enter the Old Forest leaving Fredegar Bolger behind to impersonate Frodo.",
                        "Two Nazgûl come to Bree from the South road."
                    ]
                },
                
                {
                    "day": 27,
                    "events": [
                        "Gandalf crosses River Greyflood."
                    ]
                },
                
                {
                    "day": 28,
                    "events": [
                        "Frodo and his companions traverse the Barrow-downs and are captured by a Barrow-wight. Tom Bombadil rescues them, gives them weapons and four ponies and suggests to visit the Prancing Pony at Bree.",
                        "Gandalf reaches Sarn Ford."
                    ]
                },
                
                {
                    "day": 29,
                    "events": [
                        "Gandalf, Frodo Baggins, Bilbo Baggins, Galadriel and Elrond leave Middle-earth and pass over the Sea.",
                        "Frodo and his companions reach Bree at night and stay at the Prancing Pony.",
                        "Gandalf visits the Gaffer (Hamfast Gamgee).",
                        "Strider hides behind the hedge on the Road west of Bree and eavesdrops on \"Mr. Underhill\". In the inn Frodo arouses attention by his sudden disappearance whereupon Strider warns him to be more careful and reveals himself as being Gandalf's friend."
                    ]
                },
                
                {
                    "day": 30,
                    "events": [
                        "Crickhollow is raided by three Black Riders in the early hours and Fatty Bolger alerts the village. The Black Riders run away."
                    ]
                }
            ]
        },
        
        {
            "month": 10,
            "days": [
                {
                    "day": 3,
                    "events": [
                        "Gandalf arrives at Weathertop and leave a marked stone for Aragorn. Gandalf is attacked by the Black Riders at night."
                    ]
                },

                {
                    "day": 5,
                    "events": [
                        "Gandalf, Frodo, Sam, Merry and Pippin leave Rivendell."
                    ]
                },

                {
                    "day": 6,
                    "events": [
                        "Frodo feels the pain return again.",
                        "Sam returns to Bag End on his faithful pony, Bill, after seeing of many of his friends at the Grey Havens.",
                        "The four Hobbits and Aragorn reach Weathertop at noon. Their camp is raided by the Black Riders at night and Frodo is stabbed with a Morgul Blade by the Witch King."
                    ]
                },
                
                {
                    "day": 9,
                    "events": [
                        "Glorfindel and other High Elves leave Rivendell in search of the Ring-bearer."
                    ]
                },
                
                {
                    "day": 11,
                    "events": [
                        "Glorfindel drives three Riders off the Last Bridge of Mitheithel and pursues them westward. He meets two others who flee southward. He leaves a beryl on the Bridge. He starts looking for the travellers."
                    ]
                },
                
                {
                    "day": 13,
                    "events": [
                        "The four Hobbits and Aragorn cross the Last Bridge and find the beryl left by Glorfindel."
                    ]
                },
                
                {
                    "day": 18,
                    "events": [
                        "Gandalf reaches Rivendell from the North and sends Shadowfax back to Rohan."
                    ]
                },
                
                {
                    "day": 20,
                    "events": [
                        "Glorfindel, Strider and the four hobbits reach the Ford of Bruinen where they are attacked by Black Riders. Frodo reaches the other riverside but the Riders are cast back by the water, their horses drown and their robes are destroyed.",
                        "Smaug launches an attack on Esgaroth and is killed by Bard the Bowman."
                    ]
                },
                
                {
                    "day": 24,
                    "events": [
                        "Frodo Baggins awakes in Rivendell, recovered from his wound, and meets Gandalf.",
                        "Elrond makes a feast where Frodo meets Glóin. Elladan and Elrohir return and talk to Aragorn. Evening at the Hall of Fire where Frodo meets Bilbo Baggins.",
                        "Glorfindel, Strider and the four hobbits reach the Ford of Bruinen where they are attacked by Black Riders. Frodo reaches the other riverside but the Riders are cast back by the water, their horses drown and their robes are destroyed."
                    ]
                },
                
                {
                    "day": 25,
                    "events": [
                        "Council of Elrond held in Imladris"
                    ]
                },
                
                {
                    "day": 28,
                    "events": [
                        "Gandalf and the four Hobbits reach Bree at night, and find out much has changed since they last were there."
                    ]
                },
                
                {
                    "day": 30,
                    "events": [
                        "Gandalf and the four Hobbits leave Bree. Gandalf leaves to visit Tom Bombadil."
                    ]
                }
            ]
        },
        
        {
            "month": 11,
            "days": [
                {
                    "day": 1,
                    "events": [
                        "Frodo, Sam, Pippin and Merry are arrested at Frogmorton."
                    ]
                },
                
                {
                    "day": 2,
                    "events": [
                        "The four Hobbits come to Bywater and rouse the Shire-folk."
                    ]
                },
                
                {
                    "day": 3,
                    "events": [
                        "Battle of Bywater and death of Saruman and Gríma Wormtongue. This marks the end of the War of the Ring."
                    ]
                },
                
                {
                    "day": 10,
                    "events": [
                        "Balin, Lord of Moria, is killed by an Orc archer as he stood to watch in Mirrormere."
                    ]
                },

                {
                    "day": 11,
                    "events": [
                        "A Dwarf (possibly Ori) writes in the Book of Mazarbul about Balin's death the previous day."
                    ]
                },

                {
                    "day": 23,
                    "events": [
                        "Battle of Five Armies is fought.Thorin Oakenshield, Fíli and Kíli are slain. Beorn kills Bolg son of Azog."
                    ]
                }
            ]
        },
        
        {
            "month": 12,
            "days": [
                {
                    "day": 18,
                    "events": [
                        "The members of the Fellowship of the Ring are chosen."
                    ]
                },

                {
                    "day": 25,
                    "events": [
                        "The Fellowship of the Ring leaves Rivendell."
                    ]
                }
            ]
        }
    ]
}
